In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    "col1": ["Sun", "Moon", "Sun", "Moon", "Moon", "Mars"],
    "price": [20, 30, 30, 35, 40, 55]
})
df

   col1  price
0   Sun     20
1  Moon     30
2   Sun     30
3  Moon     35
4  Moon     40
5  Mars     55

In [3]:
d = df.groupby(["col1"])["price"].mean().to_dict()
df["col1_price_mean"] = df["col1"].map(d)
df

   col1  price  col1_price_mean
0   Sun     20             25.0
1  Moon     30             35.0
2   Sun     30             25.0
3  Moon     35             35.0
4  Moon     40             35.0
5  Mars     55             55.0